g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/src/stm32f7xx_rcc.c
  CLEAR_BIT(RCC->BDCR, RCC_LSE_HIGHDRIVE_MODE);
  SET_BIT(RCC->BDCR, RCC_Mode);
}

/**
  * @brief Configures the 48MHz clock Source.
  * @param RCC_ClockSource: specifies the 48MHz clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_48MHZCLKSource_PLL: 48MHz from PLL selected.
  *            @arg RCC_48MHZCLKSource_PLLSAI: 48MHz from PLLSAI selected.
  * @retval None
  */
void RCC_48MHzClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_48MHZ_CLOCKSOURCE(RCC_ClockSource));

  if(RCC_ClockSource == RCC_48MHZCLKSource_PLLSAI)
  {
    SET_BIT(RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL);
  }
  else
  {
    CLEAR_BIT(RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL);
  }
}

/**
  * @brief Configures the SDMMC clock Source.
  * @param RCC_ClockSource: specifies the SDMMC clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SDIOCLKSource_48MHZ: 48MHz clock selected.
  *            @arg RCC_SDIOCLKSource_SYSCLK: system clock selected.
  * @retval None
  */
void RCC_SDMMCClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_SDMMC_CLOCKSOURCE(RCC_ClockSource));

  if(RCC_ClockSource == RCC_SDMMCCLKSource_SYSCLK)
  {
    SET_BIT(RCC->DCKCFGR2, RCC_DCKCFGR2_SDMMC1SEL);
  }
  else
  {
    CLEAR_BIT(RCC->DCKCFGR2, RCC_DCKCFGR2_SDMMC1SEL);
  }
}

/**
  * @brief Configures the CEC clock Source.
  * @param RCC_ClockSource: specifies the CEC clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_CECCLKSource_HSIDiv488: CEC clock from HSI/488 selected.
  *            @arg RCC_CECCLKSource_LSE: CEC clock from LSE selected.
  * @retval None
  */
void RCC_CECClockSourceConfig(uint8_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_CEC_CLOCKSOURCE(RCC_ClockSource));

#if defined(STM32F767xx)
  if(RCC_ClockSource == RCC_CECCLKSource_LSE)
  {
    SET_BIT(RCC->DCKCFGR2, RCC_DCKCFGR2_CECSEL);
  }
  else
  {
    CLEAR_BIT(RCC->DCKCFGR2, RCC_DCKCFGR2_CECSEL);
  }
#endif
}

/**
  * @brief Configures the I2Cx clock Source.
  * @param  RCC_SAIInstance: specifies the I2Cx clock source.
  *          This parameter can be one of the following values:
  *            @arg I2C1: I2C1 clock source selection
  *            @arg I2C2: I2C2 clock source selections
  *            @arg I2C3: I2C3 clock source selections
  *            @arg I2C4: I2C4 clock source selections
  * @param RCC_ClockSource: specifies the I2Cx clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2CCLKSource_APB: I2Cx clock from APBx selected.
  *            @arg RCC_I2CCLKSource_SYSCLK: I2Cx clock from Sytem clock selected.
  *            @arg RCC_I2CCLKSource_HSI: I2Cx clock from HSI selected.
  * @retval None
  */
void RCC_I2CClockSourceConfig(I2C_TypeDef * I2Cx, uint32_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_I2C_CLOCKSOURCE(RCC_ClockSource));
  assert_param(IS_I2C_ALL_INSTANCE(I2Cx));

  if(I2Cx == I2C1)
  {
    /* Clear I2C1 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_I2C1SEL;
    /* Set new I2C1 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource;
  }
  else if(I2Cx == I2C2)
  {
    /* Clear I2C2 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_I2C2SEL;
    /* Set new I2C2 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 2;
  }
  else if(I2Cx == I2C3)
  {
    /* Clear I2C3 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_I2C3SEL;
    /* Set new I2C3 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 4;
  }
#if defined(STM32F767xx)
  else if(I2Cx == I2C4)
  {
    /* Clear I2C4 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_I2C4SEL;
    /* Set new I2C4 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 6;
  }
#endif
}

/**
  * @brief Configures the USARTx/UARTx clock Source.
  * @param  RCC_SAIInstance: specifies the USARTx/UARTx clock source.
  *          This parameter can be one of the following values:
  *            @arg USART1: USART1 clock source selection
  *            @arg USART2: USART2 clock source selections
  *            @arg USART3: USART3 clock source selections
  *            @arg UART4: UART4 clock source selections
  *            @arg UART5: UART5 clock source selections
  *            @arg USART6: USART6 clock source selections
  *            @arg UART7: UART7 clock source selections
  *            @arg UART8: UART8 clock source selections
  * @param RCC_ClockSource: specifies the I2Cx clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USARTCLKSource_APB: USARTx clock from APBx selected.
  *            @arg RCC_USARTCLKSource_SYSCLK: USARTx clock from Sytem clock selected.
  *            @arg RCC_USARTCLKSource_HSI: USARTx clock from HSI selected.
  *            @arg RCC_USARTCLKSource_LSE: USARTx clock from LSE selected.
  * @retval None
  */
void RCC_USARTClockSourceConfig(USART_TypeDef * USARTx, uint32_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_I2C_CLOCKSOURCE(RCC_ClockSource));
  assert_param((IS_USART_INSTANCE(USARTx) || IS_UART_INSTANCE(USARTx)));

  if(USARTx == USART1)
  {
    /* Clear USART1 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_USART1SEL;
    /* Set new USART1 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource;
  }
  else if(USARTx == USART2)
  {
    /* Clear USART2 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_USART2SEL;
    /* Set new USART2 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 2;
  }
  else if(USARTx == USART3)
  {
    /* Clear USART3 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_USART3SEL;
    /* Set new USART3 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 4;
  }
  else if(USARTx == UART4)
  {
    /* Clear UART4 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_UART4SEL;
    /* Set new UART4 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 6;
  }
  else if(USARTx == UART5)
  {
    /* Clear UART5 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_UART5SEL;
    /* Set new UART5 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 8;
  }
  else if(USARTx == USART6)
  {
    /* Clear USART6 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_USART6SEL;
    /* Set new USART6 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 10;
  }
  else if(USARTx == UART7)
  {
    /* Clear UART7 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_UART7SEL;
    /* Set new UART7 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 12;
  }
  else if(USARTx == UART8)
  {
    /* Clear UART8 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_UART8SEL;
    /* Set new UART8 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource << 14;
  }
}

/**
  * @brief Configures the LPTIM clock Source.
  * @param  RCC_SAIInstance: specifies the LPTIMx clock source.
  *          This parameter can be one of the following values:
  *            @arg LPTIM1: LPTIM1 clock source selection
  * @param RCC_ClockSource: specifies the LPTIMx clock Source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIMCLKSource_APB: LPTIMx clock from APBx selected.
  *            @arg RCC_LPTIMCLKSource_LSI: LPTIMx clock from LSI selected.
  *            @arg RCC_LPTIMCLKSource_HSI: LPTIMx clock from HSI selected.
  *            @arg RCC_LPTIMCLKSource_LSE: LPTIMx clock from LSE selected.
  * @retval None
  */
void RCC_LPTIMClockSourceConfig(LPTIM_TypeDef * LPTIMx, uint32_t RCC_ClockSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_LPTIM_CLOCKSOURCE(RCC_ClockSource));
  assert_param(IS_LPTIM_INSTANCE(LPTIMx));

  if(LPTIMx == LPTIM1)
  {
    /* Clear I2C1 clock source selection source bits */
    RCC->DCKCFGR2 &= ~RCC_DCKCFGR2_LPTIM1SEL;
    /* Set new I2C1 clock source */
    RCC->DCKCFGR2 |= RCC_ClockSource;
  }
}


/**
  * @}
  */

/** @defgroup RCC_Group4 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions 
 *
@verbatim   
 ===============================================================================
                ##### Interrupts and flags management functions #####
 ===============================================================================  

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified RCC interrupts.
  * @param  RCC_IT: specifies the RCC interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt
  *            @arg RCC_IT_LSERDY: LSE ready interrupt
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSERDY: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY: main PLL ready interrupt
  *            @arg RCC_IT_PLLI2SRDY: PLLI2S ready interrupt
  *            @arg RCC_IT_PLLSAIRDY: PLLSAI ready interrupt
  * @param  NewState: new state of the specified RCC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_IT(RCC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    /* Perform Byte access to RCC_CIR[14:8] bits to enable the selected interrupts */
    *(__IO uint8_t *) CIR_BYTE2_ADDRESS |= RCC_IT;
  }
  else
  {
    /* Perform Byte access to RCC_CIR[14:8] bits to disable the selected interrupts */
    *(__IO uint8_t *) CIR_BYTE2_ADDRESS &= (uint8_t)~RCC_IT;
  }
}

/**
  * @brief  Checks whether the specified RCC flag is set or not.
  * @param  RCC_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg RCC_FLAG_HSIRDY: HSI oscillator clock ready
  *            @arg RCC_FLAG_HSERDY: HSE oscillator clock ready
  *            @arg RCC_FLAG_PLLRDY: main PLL clock ready
  *            @arg RCC_FLAG_PLLI2SRDY: PLLI2S clock ready
  *            @arg RCC_FLAG_PLLSAIRDY: PLLSAI clock ready (only for STM32F42xxx/43xxx devices)
  *            @arg RCC_FLAG_LSERDY: LSE oscillator clock ready
  *            @arg RCC_FLAG_LSIRDY: LSI oscillator clock ready
  *            @arg RCC_FLAG_BORRST: POR/PDR or BOR reset
  *            @arg RCC_FLAG_PINRST: Pin reset
  *            @arg RCC_FLAG_PORRST: POR/PDR reset
  *            @arg RCC_FLAG_SFTRST: Software reset
  *            @arg RCC_FLAG_IWDGRST: Independent Watchdog reset
  *            @arg RCC_FLAG_WWDGRST: Window Watchdog reset
  *            @arg RCC_FLAG_LPWRRST: Low Power reset
  * @retval The new state of RCC_FLAG (SET or RESET).
  */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
  uint32_t tmp = 0;
  uint32_t statusreg = 0;
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_RCC_FLAG(RCC_FLAG));

  /* Get the RCC register index */
  tmp = RCC_FLAG >> 5;
  if (tmp == 1)               /* The flag to check is in CR register */
  {
    statusreg = RCC->CR;
  }
  else if (tmp == 2)          /* The flag to check is in BDCR register */
  {
    statusreg = RCC->BDCR;
  }
  else                       /* The flag to check is in CSR register */
  {
    statusreg = RCC->CSR;
  }

  /* Get the flag position */
  tmp = RCC_FLAG & FLAG_MASK;
  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  Clears the RCC reset flags.
  *         The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_PORRST,  RCC_FLAG_SFTRST,
  *         RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LPWRRST
  * @param  None
  * @retval None
  */
void RCC_ClearFlag(void)
{
  /* Set RMVF bit to clear the reset flags */
  RCC->CSR |= RCC_CSR_RMVF;
}

/**
  * @brief  Checks whether the specified RCC interrupt has occurred or not.
  * @param  RCC_IT: specifies the RCC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt
  *            @arg RCC_IT_LSERDY: LSE ready interrupt
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSERDY: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY: main PLL ready interrupt
  *            @arg RCC_IT_PLLI2SRDY: PLLI2S ready interrupt           
  *            @arg RCC_IT_PLLSAIRDY: PLLSAI clock ready interrupt   
  *            @arg RCC_IT_CSS: Clock Security System interrupt
  * @retval The new state of RCC_IT (SET or RESET).
  */
ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
  ITStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_RCC_GET_IT(RCC_IT));

  /* Check the status of the specified RCC interrupt */
  if ((RCC->CIR & RCC_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the RCC_IT status */
  return  bitstatus;
}

/**
  * @brief  Clears the RCC's interrupt pending bits.
  * @param  RCC_IT: specifies the interrupt pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt
  *            @arg RCC_IT_LSERDY: LSE ready interrupt
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSERDY: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY: main PLL ready interrupt
  *            @arg RCC_IT_PLLI2SRDY: PLLI2S ready interrupt  
  *            @arg RCC_IT_PLLSAIRDY: PLLSAI ready interrupt (only for STM32F42xxx/43xxx devices)   
  *            @arg RCC_IT_CSS: Clock Security System interrupt
  * @retval None
  */
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
  /* Check the parameters */
  assert_param(IS_RCC_CLEAR_IT(RCC_IT));

  /* Perform Byte access to RCC_CIR[23:16] bits to clear the selected interrupt
     pending bits */
  *(__IO uint8_t *) CIR_BYTE3_ADDRESS = RCC_IT;
}

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/